# IFCCategory Template Get Active Template Method

Source: https://www.revitapidocs.com/2026/1e418c35-b6e5-4cbb-5ffc-98ab761edbce.htm

---

| IFCCategory Template Get Active Template Method |
| --- |

Gets the active mapping template element in the document.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static IFCCategoryTemplate GetActiveTemplate(
	Document document
)
```

```
Public Shared Function GetActiveTemplate (
	document As Document
) As IFCCategoryTemplate
```

```
public:
static IFCCategoryTemplate^ GetActiveTemplate(
	Document^ document
)
```

```
static member GetActiveTemplate :
        document : Document -> IFCCategoryTemplate
```

#### Parameters

document Document
:   The document to find the active mapping template.

#### Return Value

IFCCategoryTemplate
The active mapping template, or if none. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

Remarks New documents have no active mapping template and it implies in\-session template usage. See Also

#### Reference

IFCCategoryTemplate Class Autodesk.Revit.DB Namespace